SetIS18932002
Syntax
SapObject.SapModel.Func.FuncRS.SetIS18932002
VB6 Procedure
Function SetIS18932002(ByVal Name As String, ByVal INZ As Double, ByVal INS As Long, ByVal DampRatio As Double) As Long
Parameters
Name
The name of an existing or new function. If this is an existing function, that function is modified; otherwise, a new function is added.
INZ
The seismic zone factor, Z.
INS
This is 1, 2 or 3, indicating the soil type.
1 = I
2 = II
3 = III
DampRatio
The damping ratio for the function, 0 <= DampRatio < 1.
Remarks
This function defines a IS1893-2002 response spectrum function.
The function returns zero if the function is successfully defined; otherwise it returns a nonzero value.
VBA Example
Sub SetRSFuncIS18932002()
 'dimension variables
 Dim SapObject as cOAPI
 Dim SapModel As cSapModel
 Dim ret As Long
 'create Sap2000 object
 Set SapObject = CreateObject("CSI.SAP2000.API.SapObject")
 'start Sap2000 application
 SapObject.ApplicationStart
 'create SapModel object
 Set SapModel = SapObject.SapModel
 'initialize model
 ret = SapModel.InitializeNewModel
 'create model from template
 ret = SapModel.File.New2DFrame(PortalFrame, 2, 144, 2, 288)
 'add IS18932002 RS function
 ret = SapModel.Func.FuncRS.SetIS18932002("RS-1", 0.3, 3, 0.04)
 'close Sap2000
 SapObject.ApplicationExit False
 Set SapModel = Nothing
 Set SapObject = Nothing
 End Sub
Release Notes
Initial release in version 11.02.
See Also
GetIS18932002